# Step 1 - Acquiring Data

In this module, we will start our process to develop a model. The very first process is to obtain our data, and there are multiple ways to do that, depending on the type of data you're working on. By the end of this module, you would be able to:

* Identify multiple sources of data
* Identify different formats in which data can be found
* Use multiple Python libraries to collect data

In [4]:
import sqlite3
import requests
import pandas as pd
from bs4 import BeautifulSoup

## Using traditional data formats

### Text files

### CSV Files

In [17]:
# Loading a csv file example https://catalog.data.gov/dataset/crime-data-from-2020-to-present

crime_df = pd.read_csv("data/Crime_Data_from_2020_to_Present.csv")
crime_df.head()

,DR_NO,Date Rptd,DATE OCC,TIME OCC,AREA,AREA NAME,Rpt Dist No,Part 1-2,Crm Cd,Crm Cd Desc,...,Status,Status Desc,Crm Cd 1,Crm Cd 2,Crm Cd 3,Crm Cd 4,LOCATION,Cross Street,LAT,LON
0,10304468,01/08/2020 12:00:00 AM,01/08/2020 12:00:00 AM,2230,3,Southwest,377,2,624,BATTERY - SIMPLE ASSAULT,...,AO,Adult Other,624.0,NaN,NaN,NaN,1100 W 39TH PL,NaN,34.0141,-118.2978
1,190101086,01/02/2020 12:00:00 AM,01/01/2020 12:00:00 AM,330,1,Central,163,2,624,BATTERY - SIMPLE ASSAULT,...,IC,Invest Cont,624.0,NaN,NaN,NaN,700 S HILL ST,NaN,34.0459,-118.2545
2,200110444,04/14/2020 12:00:00 AM,02/13/2020 12:00:00 AM,1200,1,Central,155,2,845,SEX OFFENDER REGISTRANT OUT OF COMPLIANCE,...,AA,Adult Arrest,845.0,NaN,NaN,NaN,200 E 6TH ST,NaN,34.0448,-118.2474
3,191501505,01/01/2020 12:00:00 AM,01/01/2020 12:00:00 AM,1730,15,N Hollywood,1543,2,745,VANDALISM - MISDEAMEANOR ($399 OR UNDER),...,IC,Invest Cont,745.0,998.0,NaN,NaN,5400 CORTEEN PL,NaN,34.1685,-118.4019
4,191921269,01/01/2020 12:00:00 AM,01/01/2020 12:00:00 AM,415,19,Mission,1998,2,740,"VANDALISM - FELONY ($400 & OVER, ALL CHURCH VA...",...,IC,Invest Cont,740.0,NaN,NaN,NaN,14400 TITUS ST,NaN,34.2198,-118.4468

## Accessing traditional databases

Sometimes, data already comes in a database format, which can be accessed databases follow a relational database model, which is a structure.

The default language to connect with a relational database and retrieve data from it is the **Structured Query Language (SQL)**. In Python, you can perform SQL queries through the [sqlite3](https://docs.python.org/3/library/sqlite3.html) library. In the following cells, we will execute some queries using the Chinook database. You can learn more about this dataset on this [link](https://github.com/lerocha/chinook-database)

In [5]:
# First, we establish a connection with the database
conn = sqlite3.connect("data/Chinook_Sqlite.sqlite")

# The next step is to create cursor object to interact with the database
cursor = conn.cursor()

# The very first query that we will execute, will show the different tables that are part of our database
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")

# Now, we fetch the results
tables = cursor.fetchall()
tables

[('Album',),
 ('Artist',),
 ('Customer',),
 ('Employee',),
 ('Genre',),
 ('Invoice',),
 ('InvoiceLine',),
 ('MediaType',),
 ('Playlist',),
 ('PlaylistTrack',),
 ('Track',)]

As we can see, we have multiple tables in our database. Let's now perform some example queries.

In [6]:
# Retrieve all the rows information from the Album table
cursor.execute("PRAGMA table_info(Customer);")
columns = cursor.fetchall()
columns

[(0, 'CustomerId', 'INTEGER', 1, None, 1),
 (1, 'FirstName', 'NVARCHAR(40)', 1, None, 0),
 (2, 'LastName', 'NVARCHAR(20)', 1, None, 0),
 (3, 'Company', 'NVARCHAR(80)', 0, None, 0),
 (4, 'Address', 'NVARCHAR(70)', 0, None, 0),
 (5, 'City', 'NVARCHAR(40)', 0, None, 0),
 (6, 'State', 'NVARCHAR(40)', 0, None, 0),
 (7, 'Country', 'NVARCHAR(40)', 0, None, 0),
 (8, 'PostalCode', 'NVARCHAR(10)', 0, None, 0),
 (9, 'Phone', 'NVARCHAR(24)', 0, None, 0),
 (10, 'Fax', 'NVARCHAR(24)', 0, None, 0),
 (11, 'Email', 'NVARCHAR(60)', 1, None, 0),
 (12, 'SupportRepId', 'INTEGER', 0, None, 0)]

In [7]:
# Select the first 3 rows of the Customer table
cursor.execute("SELECT * FROM Customer LIMIT 3;")
rows = cursor.fetchall()
rows

[(1,
  'Luís',
  'Gonçalves',
  'Embraer - Empresa Brasileira de Aeronáutica S.A.',
  'Av. Brigadeiro Faria Lima, 2170',
  'São José dos Campos',
  'SP',
  'Brazil',
  '12227-000',
  '+55 (12) 3923-5555',
  '+55 (12) 3923-5566',
  'luisg@embraer.com.br',
  3),
 (2,
  'Leonie',
  'Köhler',
  None,
  'Theodor-Heuss-Straße 34',
  'Stuttgart',
  None,
  'Germany',
  '70174',
  '+49 0711 2842222',
  None,
  'leonekohler@surfeu.de',
  5),
 (3,
  'François',
  'Tremblay',
  None,
  '1498 rue Bélanger',
  'Montréal',
  'QC',
  'Canada',
  'H2G 1A7',
  '+1 (514) 721-4711',
  None,
  'ftremblay@gmail.com',
  3)]

In [8]:
# Select the Name and email of the Customers where Country = Germany
cursor.execute("SELECT FirstName, Email FROM Customer WHERE Country = 'Germany'")
names = cursor.fetchall()
names

[('Leonie', 'leonekohler@surfeu.de'),
 ('Hannah', 'hannah.schneider@yahoo.de'),
 ('Fynn', 'fzimmermann@yahoo.de'),
 ('Niklas', 'nschroder@surfeu.de')]

In [9]:
# Select the top 3 invoices where the total was equal or higher than 10.
cursor.execute("SELECT * FROM Invoice WHERE Total >= 10 ORDER BY Total DESC LIMIT 3")
invoices = cursor.fetchall()
invoices

[(404,
  6,
  '2013-11-13 00:00:00',
  'Rilská 3174/6',
  'Prague',
  None,
  'Czech Republic',
  '14300',
  25.86),
 (299,
  26,
  '2012-08-05 00:00:00',
  '2211 W Berry Street',
  'Fort Worth',
  'TX',
  'USA',
  '76110',
  23.86),
 (96,
  45,
  '2010-02-18 00:00:00',
  'Erzsébet krt. 58.',
  'Budapest',
  None,
  'Hungary',
  'H-1073',
  21.86)]

We have performed a few SQL queries to give you a sense on how to retrieve data from a traditional database. However, this is not a SQL focused module. If you want to learn more SQL, you can follow some of the following links:

* [Geeks for Geeks](https://www.geeksforgeeks.org/sql-tutorial/)
* [Khan Academy](https://www.khanacademy.org/computing/computer-programming/sql)
* [W3 Schools](https://www.w3schools.com/sql/)

## Accessing NoSQL databases

Many open databases follow a non-relational format or NoSQL. Most of these databases follow a [JSON](https://en.wikipedia.org/wiki/JSON) format and can be accessed through the use of an [API](https://en.wikipedia.org/wiki/API). 

Let's look an example on how to retrieve a database through an API. For the following example, we are going to use the OpenWeather platform, which offers updated weather data for multiple locations around the world.

In most of the cases, in order to retrieve data, you need first to obtain an API key, so the server can recognize you as a validate user and allow you to collect the data. OpenWeather is not the exception. Before starting the coding section, you'll need to create an account to obtain an API key:
* [OpenWeather Sign Up](https://home.openweathermap.org/users/sign_up)

In [10]:
# Collecting Weather Data from OpenWeather
api_key = "4722cd5944f586c5451f6e105a65e129" # Replace with you API Key

# For this example, we are only going to retrieve today's weather data for the city of San Diego
city = 'San Diego' # You can test with a different city
country = 'US'

url = f'http://api.openweathermap.org/data/2.5/weather?q={city},{country}&appid={api_key}'

# Send a GET request
response = requests.get(url)

if response.status_code == 200: # We verify that our request was successful
    data = response.json()
else:
    print(response.status_code) # In case our request was not successful, we return the status code
data

{'coord': {'lon': -117.1573, 'lat': 32.7153},
 'weather': [{'id': 803,
   'main': 'Clouds',
   'description': 'broken clouds',
   'icon': '04d'}],
 'base': 'stations',
 'main': {'temp': 293.08,
  'feels_like': 293.09,
  'temp_min': 290.79,
  'temp_max': 296.04,
  'pressure': 1015,
  'humidity': 75},
 'visibility': 10000,
 'wind': {'speed': 6.17, 'deg': 270},
 'clouds': {'all': 75},
 'dt': 1699398433,
 'sys': {'type': 1,
  'id': 5771,
  'country': 'US',
  'sunrise': 1699366283,
  'sunset': 1699404795},
 'timezone': -28800,
 'id': 5391811,
 'name': 'San Diego',
 'cod': 200}

As you can see, we collected our data in JSON format. However, this data is hard to work with in the current format. Let's do some transformations to use the data we need in a Pandas Dataframe.

In [11]:
# We are going to keep the name of the city, country, temperature, humidity and the description of the weather 
weather_data = {
        'City': data['name'],
        'Country': data['sys']['country'],
        'Temperature (Celsius)': data['main']['temp'] - 273.15,  # Data comes in Kelvin by default. We convert to Celsius.
        'Humidity (%)': data['main']['humidity'],
        'Description': data['weather'][0]['description']
    }

# Create a Pandas DataFrame
df = pd.DataFrame([weather_data])
df

        City Country  Temperature (Celsius)  Humidity (%)    Description
0  San Diego      US                  19.93            75  broken clouds

Much better!

In this example, we only collected data for a single city. However, you can think of a case in which you could retrieve a lot of cities for multiple dates and build a huge dataset.

## Web-Scrapping

Another way to collect data is through Web-Scrapping, which refers to the technique of directly collecting data from websites. A common python library to perform this task is [BeautifulSoup](https://www.crummy.com/software/BeautifulSoup/bs4/doc/) 

Imagine for example, that you wanted to analyze the sentiment and narrative of some of the most important news websites through the titles of their articles. In the following code, we are going to collect all the article titles from the BBC News main page.

In [12]:
# Web-Scrapping job to collect the titles of the news.
url = 'https://www.bbc.com/news'
response = requests.get(url)

if response.status_code == 200:
    soup = BeautifulSoup(response.text, 'html.parser') # We are creating a HTML parser over the text of our response
    article_titles = soup.find_all('h3', class_='gs-c-promo-heading__title')
    for title in article_titles:
        print(title.text)
else:
    print(response.status_code)

Israel says its troops are 'in the heart of Gaza City'
Israel says its troops are 'in the heart of Gaza City'
Gaza journalist killed alongside 42 relatives, news agency says
What to watch for in today's US elections
Supreme Court to decide if domestic abusers can have guns
Why Trump may have deliberately provoked judge
'I blew the whistle on Meta, now I won't work again'
Poet Rupi Kaur rejects White House invite over Gaza
What to expect from the third Republican debate
Birthday gift grenade kills Ukraine army chief aide
Jewish man's death at US protests ruled a homicide
Hunter Biden investigator denies political meddling
Jewish man's death at US protests ruled a homicide
Hunter Biden investigator denies political meddling
First images revealed from 'dark Universe' mission
Christie's sells rare blue diamond for over $40m
Deer soars over two cars in New Jersey
Netanyahu hints at control of Gaza after war
Canadian chooses to stay in Gaza to document war
Civilians leave northern Gaza along evacuation corridor
Israeli air strikes rock residential buildings in al-Zahra
Israeli archaeologists help find attack victims
The reality of passive income streams
BBC World News TV
BBC World Service Radio
'Nicolas Cage at his darkly comic best'
Who is Black Rod? Centuries-old role at heart of Parliament
'Yes, you're good enough - but you're a girl'
Chinese tourists are back - but not in Thailand
'Being a hyped, buzzy band can be a bit of a curse'
Daily pill to prevent breast cancer approved in England
Playing Prince Harry: wig, accent - and no suntan
Global wine production falls to 62-year low
Disney stands by London bombing scenes in new drama
Cruise passengers 'feared for their lives' in storm
Johnson wanted to be injected with Covid, inquiry told
Former child star Evan Ellingson dies at 35
Can AI really be regulated?
The reality of passive income streams
A new life for Europe's 'dirty' city
'Nicolas Cage at his darkly comic best'
How bubble veils muffle wind farm noise
Spotify's big audiobooks move
Is this the taste of Diwali?
Haaland scores twice as Man City reach knockouts
Shakhtar Donetsk stun Barcelona in Hamburg
Dortmund dent Newcastle's qualification hopes
Atletico Madrid hit 10-man Celtic for six
Is Maxwell's 'miracle' the greatest men's ODI innings?
England 'unprofessional' over alleged racial slur
'Committed' Rashford returns to Man Utd squad

You can think of more extended versions of the previous task, like extracting the full articles and extracting data from multiple news sites.